{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.15.0",
  "convertedBy": "TensorFlow.js Converter v4.15.0",
  "modelTopology": {
    "keras_version": "2.13.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "risk_assessment_model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 6],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 20,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 12,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "output_layer",
              "trainable": true,
              "dtype": "float32",
              "units": 3,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"],
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "learning_rate": 0.001,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {"name": "dense_1/kernel", "shape": [6, 20], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [20], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [20, 12], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [12], "dtype": "float32"},
        {"name": "output_layer/kernel", "shape": [12, 3], "dtype": "float32"},
        {"name": "output_layer/bias", "shape": [3], "dtype": "float32"}
      ]
    }
  ]
}